'''
假设你负责一个小型网络,有3台设备,请定义变量并打印如下格式的IP规划表:

========== IP地址规划表 ==========
设备名称          管理地址          角色
-----------------------------------------
CoreSwitch        10.1.1.1          核心交换机
Firewall          10.1.1.2          防火墙
WLC               10.1.1.3          无线控制器
=========================================
提示: 可以直接用多个print语句，也可以尝试用 \t (Tab) 来对齐。
'''
dev_list = ['CoreSwitch','Firewall','WLC']
ip_list = ['10.1.1.1','10.1.1.2','10.1.1.3']
role_list = ['核心交换机','防火墙','无线控制器']

print('================= IP地址规划表 =================')
print(f"{'设备名称':<15}{'管理地址':<15}{'角色':<15}")
print(f"{'------------------------------------------------':<20}")
print(f"{dev_list[0]:<20}{ip_list[0]:<15}{role_list[0]:<15}")
print(f"{dev_list[1]:<20}{ip_list[1]:<15}{role_list[1]:<15}")
print(f"{dev_list[2]:<20}{ip_list[2]:<15}{role_list[2]:<15}")
print("=================================================")





